Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/tax/income_tax/index.html.txt.tmx
Source language: en
Languages: ga

source: How your income tax is calculated
ga: An córas le cáin a mheas

source: Tax on income you earn from employment is deducted directly from your salary (pay)
ga: Cur síos ar an gcóras nua creidhmheasanna cánacha

source: Universal Social Charge (USC)
ga: Muirear Sóisialta Uilíoch (MSU)

source: The Universal Social Charge is a tax payable on gross income that came into effect on 1 January 2011
ga: Is cáin é an Muirear Sóisialta Uilíoch (MSU) iníoctha ar ioncam comhlán a tháinig i bhfeidhm an 1 Eanáir 2011

source: Online services for PAYE taxpayers
ga: Seirbhísí ar líne do cháiníocóirí ÍMAT

source: You can use the PAYE Anytime service or the Jobs and Pensions service from Revenue to manage your tax if you are a PAYE taxpayer
ga: Cuimsíonn siad seo seirbhísí a ligeann duit amharc ar do thaifead cánach, d’fhaisnéis phearsanta a nuashonrú agus creidmheasanna cánach agus faoiseamh a éileamh

source: Taxation of married people and civil partners
ga: Gearradh cánach ar dhaoine pósta in Éirinn

source: There are three ways in which you can be taxed as a married person
ga: Tá trí bhealach inar féidir cáin a ghearradh ort mar dhuine pósta in Éirinn

source: Explore the options and find out how to apply
ga: Déan iniúchadh ar na roghanna agus faigh amach cén chaoi iarratas a dhéanamh

source: Taxation of benefits from employment
ga: Cáin ar shochair ón bhfostaíocht

source: Employees can get certain benefits in addition to their salary or wages. Some of these benefits are taxed. This document provides information on how such benefits are taxed
ga: Tá cur síos sa cháipéis seo ar na príomhshochair gur féidir le fostaí a fháil sa bhreis ar a t(h)uarastal/pá agus conas a ngearrtar cáin ar na sochair sin

source: Artist's exemption from income tax
ga: Díolúine ó cháin iomcaim ag ealaíontóirí

source: Some income earned by artists, writers, sculpturs and painters in Ireland from the sale of their work may be exempt from income tax
ga: D'fhéadfadh ioncam a thuilleann ealaíontóirí, scríbhneoirí, dealbhóirí agus péintéirí in Éirinn ón gcuid saothair a bheith díolmhaithe ó cháin ioncaim

source: How to obtain exemption from income tax if you are an artist and satisfy certain criteria
ga: Faigh amach conas díolúine a fháil ó cháin ioncaim más ealaíontóir tú

source: PAYE overpayments and underpayments of tax
ga: Ró-íocaíochtaí agus gearríocaíochtaí cánach ÍMAT

source: This document explains how you can find out if you have underpaid or overpaid tax
ga: Míníonn an doiciméad seo conas is féidir leat a fháil amach an bhfuil tú tar éis ró-íocaíocht nó gearríocaíocht cánach a dhéanamh

source: It also explains how to get a refund of tax or pay tax you may owe
ga: Míníonn sé freisin conas aisíoc cánach a fháil nó cáin atá le n-íoc agat a íoc

source: Taxation of social welfare payments
ga: Gearradh cánach ar íocaíochtaí leasa shóisialaigh

source: Social welfare payments may or may not be deemed taxable in Ireland
ga: Bíodh sin mar atá, d'fhéadfadh d'íocaíocht leasa shóisialaigh a bheith inchánaithe nó saor ó cháin in Éirinn

source: Information about how which social welfare payments are taxable and how they are taxed
ga: Faigh amach na rialacha canachais na n-íocaíochtaí leasa shóisialaigh

source: This document is in: Social Welfare > Irish social welfare system > Claiming a social welfare payment
ga: This document is in: Leas Sóisialach > Córas Leasa Shóisialaigh na hÉireann > Íocaíocht Leasa Shóisialaigh a Éileamh

source: Tax and starting work - PAYE
ga: Cáin agus tosú ar obair

source: Most employees have their tax deducted from their salary by their employer
ga: Is é an fostóir a asbhaineann cáin as tuarastal fhormhór na bhfostaithe

source: Find out what you need to know about tax when starting work
ga: Faigh amach an méid a chaithfidh a bheith ar eolas agat faoi cháin nuair a thosaíonn tú ag obair

source: This document is in: Employment > Starting work and changing job > Starting work
ga: This document is in: Fostaíocht > Tosú ag obair agus athrú jabanna > Tosú ag obair

source: Changing job: tax, PRSI and pension
ga: Athrú poist: cáin, ÁSPC agus pinsean

source: There are various steps to be taken when changing job, particularly in relation to tax, social insurance (PRSI) and pension
ga: Tá céimeanna éagsúla ann le glacadh le linn athrú poist maidir le cáin, ÁSPC agus pinsean

source: This document is in: Employment > Starting work and changing job > Changing job
ga: This document is in: Fostaíocht > Tosú ag obair agus athrú jabanna > Athrú jabanna

source: Taxation of lump sum payment on redundancy or retirement
ga: Cáin ar chnapshuim iomarcaíochta nó scoir

source: Lump sum payments in compensation for loss of employment are subject to tax
ga: Tá cur síos anseo ar an gcóras le cáin a ghearradh ar chúiteamh a íoctar ina chnapshuim nuair a chailltear fostaíocht

source: How is tax calculated and what are your entitlements?
ga: Conas a mheastar an cháin agus cad é do theidlíochtaí?

source: This document is in: Employment > Retirement > Income Tax in Retirement
ga: This document is in: Fostaíocht > Dul ar scor > Cáin ioncaim do lucht pinsin

source: Tax refund when unemployed or out of work sick
ga: Cóid chánach agus páirtnéireacht shibhialta

source: Explanation of how to get a tax refund if you have worked and are now unemployed or out of work due to illness
ga: Tá fáil anois ar na forálacha cánach a bhaineann le lanúineacha pósta ag páirtnéirí sibhialta

source: How to comply with your tax obligations
ga: Conas do dhualgais chánach a chomhlíonadh

source: Tax codes and civil partnership
ga: Is cáin ar do chuid ioncaim é an tobhach ioncaim

source: The tax provisions that apply to married couples are now available to civil partners
ga: Go ginearálta, bíonn an méid atá dlite ort ag brath ar an bpá a thuilleann tú

source: Find out more about how civil partners are treated under the tax code
ga: Faigh tuilleadh eolais ar an mbealach a ghearrtar tobhach ar do chuid ioncaim

source: Most Read in "Money and Tax"
ga: Ábhar is mó éilimh i "Airgead agus Cáin"

source: Introduction to income tax credits and reliefs
ga: Réamhrá ar chreidmheasanna cánach agus faoiseamh ó cháin ioncaim

source: Taxation and medical expenses
ga: Cáin agus costais leighis
